Autodesk.Revit.DB.Electrical.AnalyticalLoadScenario.Create(Autodesk.Revit.DB.Document,System.String)
Creates a load scenario.
document:
The document in which to create the load scenario.
name:
The name of new load scenario. The actual name may be post-fixed if already exists.
Returns:
The newly created load scenario.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).

Autodesk.Revit.DB.Electrical.AnalyticalLoadScenario
Represents the data and parameters of electrical analytical load scenario.